@jmandawg , thank you for reporting this issue.

I believe the fix on #1737 should address your problem. You will need to run `terraform init --upgrade` to update your provider version.

Here I attached example test on my end using AWSCC version **1.4.0**.

```
awscc_iam_role.main: Refreshing state... [id=PFE5Ch2mjmCKXYiO1AVT5U4HG-1cMxZNSeMSVs]
awscc_lambda_function.main: Refreshing state... [id=lambda_function_name]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # awscc_lambda_function.main will be updated in-place
  ~ resource "awscc_lambda_function" "main" {
      ~ code                           = {
          + image_uri         = (known after apply)
          + s3_bucket         = (known after apply)
          + s3_key            = (known after apply)
          + s3_object_version = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + file_system_configs            = (known after apply)
      ~ handler                        = "index.lambda_handler" -> "main.lambda_handler"
        id                             = "lambda_function_name"
      + image_config                   = (known after apply)
      + kms_key_arn                    = (known after apply)
      + layers                         = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      ~ runtime_management_config      = {
          + runtime_version_arn = "arn:aws:lambda:us-east-1::runtime:fdfcd1a9a807a50c4f1a530b8776d5a12d6cb4fac8d6c8338d5ddd7ac4b75d7c"
          ~ update_runtime_on   = "Auto" -> "Manual"
        }
      + tags                           = (known after apply)
      + vpc_config                     = (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
awscc_lambda_function.main: Modifying... [id=lambda_function_name]
awscc_lambda_function.main: Still modifying... [id=lambda_function_name, 10s elapsed]
awscc_lambda_function.main: Still modifying... [id=lambda_function_name, 20s elapsed]
awscc_lambda_function.main: Modifications complete after 27s [id=lambda_function_name]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```